src/Documents/ПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПеремещениеДенежныхСредств</Name>
			<Comment>Перемещение денежных средств</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарь</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассаКомпании</Name>
					<Comment>Касса компании, из которой уходят денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаКомпанииПолучатель</Name>
					<Comment>Касса компании, в которую приходят денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредстваКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКомпании</Name>
			<Comment>Блок учета денежные средства компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движений денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта хранения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурная единица (расчетный счет, касса компании, касса ККМ, ценная бумага) - место хранения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеДенежныхСредств/Ext/ManagerModule.bsl
// Модуль менеджера документа "Перемещение денежных средств"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.СуммаДокумента);
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Установка банковского счета в соответствии с организацией
//
Процедура УстановитьБанковскийСчет(Объект, ПараметрыДействия)
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ПеремещениеДенежныхСредств Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.КассаКомпанииПолучатель.Пустая() Тогда
		Объект.КассаКомпанииПолучатель = Объект.Организация.ОсновнойБанковскийСчет;
	Иначе
		Результат = ОбработкаСобытийДокументаСервер.ПроверитьКорректностьБанковскогоСчета(Объект.КассаКомпанииПолучатель,
													Объект.Организация, Объект.ПодразделениеКомпании);
		Если НЕ Результат Тогда
			Объект.КассаКомпанииПолучатель = Объект.Организация.ОсновнойБанковскийСчет;
			КассаКомпанииПолучательПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьБанковскийСчет()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("КассаКомпании");
	ОбязательныеРеквизиты.Добавить("КассаКомпанииПолучатель");
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("СуммаДокумента");
	ОбязательныеРеквизиты.Добавить("СтатьяДДС");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	КонтролируемыеРеквизиты.Вставить("КассаКомпании", Ложь);
	КонтролируемыеРеквизиты.Вставить("КассаКомпанииПолучатель");
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", ИСТИНА);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Установим банковский счет
	УстановитьБанковскийСчет(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
	// Установим банковский счет
	УстановитьБанковскийСчет(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Присвоим тип данных Касс или Банковских счетов в зависимости от хоз операции.
	Если Объект.ХозОперация = Справочники.ХозОперации.ПеремещениеДенежныхСредств Тогда
		Объект.КассаКомпанииПолучатель = Новый(Тип("СправочникСсылка.КассыКомпании"));
	Иначе
		Объект.КассаКомпанииПолучатель = Новый(Тип("СправочникСсылка.БанковскиеСчета"));
	КонецЕсли;

КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.СуммаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Касса-отправитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КассаКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	КассаКомпании           = Объект.КассаКомпании;
	КассаКомпанииПолучатель = Объект.КассаКомпанииПолучатель;
	ВалютаДокумента         = Объект.ВалютаДокумента;
	
	Если (НЕ ЗначениеЗаполнено(КассаКомпании)) ИЛИ КассаКомпании.МноговалютнаяКасса Тогда
		Возврат;
	КонецЕсли;
	
	// Если выбрана одновалютная касса
	Если ТипЗнч(КассаКомпанииПолучатель) = Тип("СправочникСсылка.КассыКомпании") Тогда
		
		Если (НЕ ЗначениеЗаполнено(КассаКомпанииПолучатель) ИЛИ КассаКомпанииПолучатель.МноговалютнаяКасса) Тогда
			// Касса-получатель либо не заполнена либо многовалютная - значит нам рулить валютой документа.
			Объект.ВалютаДокумента = КассаКомпании.ВалютаДенежныхСредств;
			ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(КассаКомпанииПолучатель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Если НЕ ЗначениеЗаполнено(КассаКомпанииПолучатель) Тогда
			// Касса-получатель либо не заполнена либо многовалютная - значит нам рулить валютой документа.
			Объект.ВалютаДокумента = КассаКомпании.ВалютаДенежныхСредств;
			ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // КассаКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Касса-получатель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КассаКомпанииПолучательПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	КассаКомпании           = Объект.КассаКомпании;
	КассаКомпанииПолучатель = Объект.КассаКомпанииПолучатель;
	ВалютаДокумента         = Объект.ВалютаДокумента;
	
	Если ТипЗнч(КассаКомпанииПолучатель) = Тип("СправочникСсылка.КассыКомпании") Тогда
		
		Если ЗначениеЗаполнено(КассаКомпанииПолучатель) И (НЕ КассаКомпанииПолучатель.МноговалютнаяКасса) Тогда
			// Если выбрана одновалютная касса
			Если (НЕ ЗначениеЗаполнено(КассаКомпании)) ИЛИ КассаКомпании.МноговалютнаяКасса Тогда
				// Касса компании либо не заполнена либо многовалютная - значит нам рулить валютой документа.
				Объект.ВалютаДокумента = КассаКомпанииПолучатель.ВалютаДенежныхСредств;
				ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(КассаКомпанииПолучатель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Если ЗначениеЗаполнено(КассаКомпанииПолучатель) Тогда
			
			Если НЕ ЗначениеЗаполнено(КассаКомпании) Тогда
				// Расчетный счет компании не заполнен - значит нам рулить валютой документа.
				Объект.ВалютаДокумента = КассаКомпанииПолучатель.ВалютаДенежныхСредств;
				ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим соответствие расчетного счета к организации
		Если КассаКомпанииПолучатель <> Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БанковскиеСчета.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) В (ТИП(Справочник.Организации), ТИП(Справочник.ПодразделенияКомпании))";
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			РасчетныйСчетОрганизаций = Новый Массив;
			РасчетныйСчетОрганизаций = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
			ПроверкаСчета = РасчетныйСчетОрганизаций.Найти(КассаКомпанииПолучатель);
			Если ПроверкаСчета = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расчетный счет <" + КассаКомпанииПолучатель + " > не относится к организации или подразделению.'"),, "КассаКомпанииПолучатель", "Объект");
				Объект.КассаКомпанииПолучатель = Справочники.БанковскиеСчета.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // КассаКомпанииПолучательПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СтатьяДДСПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // СтатьяДДСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ПеремещениеДенежныхСредств",
		"ПФ_MXL_ПеремещениеДенежныхСредств",
		НСтр("ru = 'Перемещение денежных средств'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ПеремещениеДенежныхСредств",
		"ПФ_MXL_ПеремещениеДенежныхСредствНаРасчетныйСчет",
		НСтр("ru = 'Перемещение денежных средств на расчетный счет'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПеремещениеДенежныхСредств") Тогда
										УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
										"ПФ_MXL_ПеремещениеДенежныхСредств",
										НСтр("ru = 'Перемещение денежных средств'"),
										ПечатьПеремещениеДенежныхСредств(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПеремещениеДенежныхСредствНаРасчетныйСчет") Тогда
										УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
										"ПФ_MXL_ПеремещениеДенежныхСредствНаРасчетныйСчет",
										НСтр("ru = 'Перемещение денежных средств на расчетный счет'"),
										ПечатьРасходныйКассовыйОрдер(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;			
КонецПроцедуры // Печать()

// Формирует печатную форму "Перемещение денежных средств на расчетный счет"
// 
Функция ПечатьРасходныйКассовыйОрдер(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеДенежныхСредств_ПеремещениеДенежныхСредствНаРасчетныйСчет";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеДенежныхСредств.ПФ_MXL_ПеремещениеДенежныхСредствНаРасчетныйСчет");
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		Если Не Документ.ХозОперация = Справочники.ХозОперации.ПеремещениеДенежныхСредствНаРасчетныйСчет Тогда
			ВывестиСообщение(НСтр("ru = 'Печать <Перемещение денежных средств на расчетный счет> не разрешена для хозяйственной операции <'") + Документ.ХозОперация.Наименование + ">");
		Иначе
		
			// Получаем область шапки документа
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Документ);
			ОбластьМакета.Параметры.СуммаДокумента = Формат(Документ.СуммаДокумента,ФорматВыводаСуммы);
			
			ОбластьМакета.Параметры.ОрганизацияПоОКПО	= Документ.Организация.КодПоОКПО;
			ОбластьМакета.Параметры.КодПодразделения	= Документ.ПодразделениеКомпании.Код;
			
			ОбластьМакета.Параметры.КредитСубСчет		= ?(Документ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),"50.1","50.2");
			ОбластьМакета.Параметры.ДебетСубСчет		= Документ.СтатьяДДС.КоррСчет.Код;

			ОбластьМакета.Параметры.СуммаПрописью		= РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.СуммаДокумента, Документ.ВалютаДокумента);
		
			Руководитель = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ, Перечисления.ВидыОбъектовСведений.Руководитель);
			ГлавныйБухгалтер = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
			Кассир = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ, Перечисления.ВидыОбъектовСведений.Кассир);
			ОбластьМакета.Параметры.Заполнить(Руководитель);
			ОбластьМакета.Параметры.Заполнить(ГлавныйБухгалтер);
			ОбластьМакета.Параметры.Заполнить(Кассир);
			
			ОбластьМакета.Параметры.Номер = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Документ);
			ОбластьМакета.Параметры.Подразделение = Документ.ПодразделениеКомпании;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// отметим конец области документа
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьРасходныйКассовыйОрдер()

// Формирует печатную форму "Перемещение денежных средств"
// 
Функция ПечатьПеремещениеДенежныхСредств(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеДенежныхСредств_ПеремещениеДенежныхСредств";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеДенежныхСредств.ПФ_MXL_ПеремещениеДенежныхСредств");
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		Если Не Документ.ХозОперация = Справочники.ХозОперации.ПеремещениеДенежныхСредств Тогда
			ВывестиСообщение(НСтр("ru = 'Печать <Перемещение денежных средств> не разрешена для хозяйственной операции <'") + Документ.ХозОперация.Наименование + ">");
		Иначе
		
			// Получаем область шапки документа
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаДокумента");
			ОбластьМакета.Параметры.Заполнить(Документ);
			ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ);
			ОбластьМакета.Параметры.ТекстЗаголовка	= ТекстЗаголовка;
			ОбластьМакета.Параметры.КассаКомпании = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.КассаКомпании);
			ОбластьМакета.Параметры.КассаПолучатель = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.КассаКомпанииПолучатель);    
			
			// Получим остаток
			СтруктураОтбораДляКассыКомпании	            = Новый Структура("Валюта, СтруктурнаяЕдиница", Документ.ВалютаДокумента, Документ.КассаКомпании);
			СтруктураОтбораДляКассыКомпанииПолучателя	= Новый Структура("Валюта, СтруктурнаяЕдиница", Документ.ВалютаДокумента, Документ.КассаКомпанииПолучатель);
			ОстатокКомпании			                    = РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(, СтруктураОтбораДляКассыКомпании,, "Сумма").Итог("Сумма");
			ОстатокКомпанииПолучателя			        = РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(, СтруктураОтбораДляКассыКомпанииПолучателя,, "Сумма").Итог("Сумма");
			
			ОбластьМакета.Параметры.ОстатокВКассеКомпании           = Формат(ОстатокКомпании, "ЧЦ=15; ЧДЦ=2; ЧН=0") + " " + СокрЛП(Документ.ВалютаДокумента.Наименование);
			ОбластьМакета.Параметры.ОстатокВКассеКомпанииПолучателя = Формат(ОстатокКомпанииПолучателя, "ЧЦ=15; ЧДЦ=2; ЧН=0") + " " + СокрЛП(Документ.ВалютаДокумента.Наименование);
			
			ОбластьМакета.Параметры.Сумма       = Формат(Документ.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧН=0") + " " + СокрЛП(Документ.ВалютаДокумента.Наименование);
			ОбластьМакета.Параметры.СтатьяДДС   = Документ.СтатьяДДС.Наименование;
			ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.СуммаДокумента,Документ.ВалютаДокумента);
			
			// вывод свойств
			УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьМакета, Документ);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			// отметим конец области документа
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьПеремещениеДенежныхСредств()

#КонецЕсли
